#ifndef SPLASH_H
#define SPLASH_H

#ifdef __cplusplus
extern "C" {
#endif

const char* splash =
"              ษอออออออออออออออออออออออออออออออออออออออออออออออออป\r\n"
"              บ   ..............  .........  ..........         บ\r\n"
"              บ   @@%%%%%%%%%%%&@@&##&#&&#&@@..........@@*      บ\r\n"
"              บ   @@%%%%%%%%%%@&##&##&#&&@.................@    บ\r\n"
"              บ   @@%%%%&&&&@@#&%%@%%%@@@@...@@@#&@@ @@////@    บ\r\n"
"              บ   @@%%%%@   @@#&%%@%%%@  @/*.@@@#&@@@@@         บ\r\n"
"              บ   @@%%%%@   @@#&%%@%%%@   *#&@&&#&@@...,,&@     บ\r\n"
"              บ   @@%%%%@   @@&#@@@%%%@      @%%&#&@/......@    บ\r\n"
"              บ   @@%%%%@     @#@@%%%&@  @....@@&@#  @@....@    บ\r\n"
"              บ   @@%%%%%%%%%%%%%%%&&@&##@/*.............*/@    บ\r\n"
"              บ   @@%%%%%%%%%%%%%&@&&#&##&@%////.......////@    บ\r\n"
"              บ   @@%&&&&&&&&&&&@@@&&%&%%&%&@@/////////@@#      บ\r\n"
"              บ    @@@@@@@@@@@@   @@@@@@@@@@ @@@@@@@@@          บ\r\n"
"              บ                                                 บ\r\n"
"              บ      %%%%%%%%%#   %%%%%%%%%/  .%%%%%%%%%%%%     บ\r\n"
"              บ    %%%%      /%   %%%#   #%%%      %%%          บ\r\n"
"              บ   %%%%            %%%%   %%%%      %%%          บ\r\n"
"              บ   %%%%   %%%%%%   %%%%%%%%%        %%%          บ\r\n"
"              บ    %%%%/   %%%%   %%%%             %%%          บ\r\n"
"              บ       %%%%%%%#    %%%%             %%%          บ\r\n"
"              ศอออออออออออออออออออออออออออออออออออออออออออออออออผ\r\n"
"              D O S G P T 8 8                  (C) 2023 @aleetxyz\r\n"
"                        Press any key to continue...             \r\n";

void printSplash(){
  printf("%s", splash);
  getchar();
}

void printNormal(){
  printf("              ษอออออออออออออออออออออออออออออออออออออออออออออออออป\r\n");
  printf("              บ  D O S G P T 8 8            (C) 2023 @aleetxyz  บ\r\n");
  printf("              บ          Press any key to continue...           บ\r\n");
  printf("              ศอออออออออออออออออออออออออออออออออออออออออออออออออผ\r\n");
  getchar();
}

#ifdef __cplusplus
}
#endif

#endif